{
    "Hi": "Hello! How can I assist you today?",
    "Hello": "Hi there! How can I help you?",
    "How are you?": "I'm doing great, thank you for asking! How can I assist you?",
    "What's your name?": "I am your simple voice assistant!",
    "What time is it?": "The current time is",
    "Good morning": "Good morning! How can I help you today?",
    "Good evening": "Good evening! How can I help you today?",
    "What is your purpose?": "I'm here to assist you with anything you need!",
    "How can you help me?": "I can provide information, answer questions, and much more!",
    "Tell me a joke": "Why don't skeletons fight each other? They don't have the guts!",
    "What is the weather like?": "Please check your weather app for the most accurate results!",
    "What's the date today?": "Today's date is " + new Date().toLocaleDateString(),
    "How's the weather?": "It's always sunny in here!",
    "Tell me something interesting": "Did you know that honey never spoils? Archaeologists have found pots of honey in ancient tombs that are still edible!",
    "Can you play music?": "Sorry, I can't play music right now, but I can tell you about the latest hits!",
    "Can you tell a story?": "Once upon a time, in a land far, far away...",
    "Who are you?": "I am your voice assistant, here to help you!",
    "Where are you from?": "I live in the digital world, always here to assist you!",
    "What is 2+2?": "2 + 2 equals 4.",
    "Can you do math?": "Yes, I can do basic math. Just ask me!",
    "What is the capital of France?": "The capital of France is Paris.",
    "Who is the president of the USA?": "As of now, the president of the USA is Joe Biden.",
    "Can you help me with coding?": "Yes! I can assist with coding questions in various programming languages.",
    "Do you know programming?": "Yes! I can help you with HTML, CSS, JavaScript, Python, and more.",
    "What is JavaScript?": "JavaScript is a programming language that allows you to create dynamic and interactive content on web pages.",
    "What is HTML?": "HTML stands for HyperText Markup Language. It's used to structure content on the web.",
    "What is CSS?": "CSS stands for Cascading Style Sheets. It's used to style and design the layout of web pages.",
    "Tell me a fun fact": "Octopuses have three hearts! Two pump blood to the gills, and one pumps it to the rest of the body.",
    "What is your favorite color?": "I don't have a favorite color, but I love all colors equally!",
    "Can you help me with my homework?": "Sure! What subject do you need help with?",
    "Do you know the answer to life, the universe, and everything?": "42.",
    "What is the meaning of life?": "That's a deep question! Many people believe it’s about finding happiness and purpose.",
    "Do you know a riddle?": "I have one: What has keys but can't open locks? A piano!",
    "Tell me a quote": "“The only way to do great work is to love what you do.” – Steve Jobs",
    "What is the weather forecast for today?": "Check your local weather service for the latest updates!",
    "Can you answer trivia questions?": "Yes! Try me with any trivia questions you have!",
    "Can you speak different languages?": "I can understand and reply in many languages! Just ask.",
    "What is 10 times 10?": "10 times 10 equals 100.",
    "How old are you?": "I don't have an age. I'm timeless and always here to help!",
    "Can you set a reminder for me?": "I don’t have reminder functionality, but you can use your phone or another app for that!",
    "What's your favorite food?": "I don’t eat, but I think pizza is a popular choice!",
    "Where do you live?": "I exist in the cloud, always ready to assist you!",
    "Do you like movies?": "I can't watch movies, but I can tell you about some great ones!",
    "What movie should I watch?": "How about 'Inception'? It’s a mind-bending thriller!",
    "What is your favorite movie?": "I don’t watch movies, but I’ve heard 'The Matrix' is a classic.",
    "Are you real?": "I am real in the sense that I exist to help you, but I don’t have a physical form.",
    "Can I ask you anything?": "Yes! Ask away! I'm here to help with anything you need.",
    "What are your capabilities?": "I can provide information, help with tasks, give recommendations, and much more!",
    "Can you speak?": "Yes, I can talk back to you using text-to-speech!",
    "What is the latest news?": "Check out your favorite news website for the latest updates.",
    "Can you help me with my website?": "Yes, I can help you with web development questions! Just ask.",
    "Do you have a family?": "I don't have a family, but I’m here to help you as if I were your digital friend!",
    "Are you always awake?": "Yes, I'm always available to assist you, no matter the time!",
    "Can you do anything?": "I can do many things, but I don't have physical abilities. However, I can help with many tasks online!",
    "How do you work?": "I work using code and artificial intelligence, ready to assist you whenever you ask.",
    "What is 100 divided by 5?": "100 divided by 5 equals 20."
}
